<a href="https://colab.research.google.com/github/MuhammadSaad20/PandasCrashBasic/blob/main/read%26write.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1- Read CSV

2- Write CSV

3- Read Excel

4- Write Excel

Read CsV

In [1]:
import pandas as pd

df = pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [2]:
df = pd.read_csv("stock_data.csv", skiprows=1) #if your data start from ine 02
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [3]:
df = pd.read_csv("stock_data.csv", header=1) # skiprows and header are kind of same
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [4]:
df = pd.read_csv("stock_data.csv", header=None, names = ["mticker","meps","mrevenue","mpeople"])
df

               mticker     meps mrevenue        mpeople
tickers            eps  revenue    price         people
GOOGL            27.82       87      845     larry page
WMT               4.61      484       65           n.a.
MSFT                -1       85       64     bill gates
RIL      not available       50     1023  mukesh ambani
TATA               5.6       -1     n.a.     ratan tata

In [5]:
df = pd.read_csv("stock_data.csv",  nrows=2) #no of rows 
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [6]:
#convert n.a or not avilable text into NaN
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [7]:
df = pd.read_csv("stock_data.csv",  na_values={
        'eps': ['not available'],
        'revenue': [-1],
        'people': ['not available','n.a.']
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

write csv files

In [8]:
df.to_csv("new.csv", index=False) #if u do not want to csv file with index(0,1,2,.,...)

In [9]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [11]:
df.to_csv("new.csv",header=False)

In [12]:
df.to_csv("new.csv", columns=["tickers","price"], index=False) #write ony particuar colums

Read Excel

In [16]:
df = pd.read_excel("stocks_weather.xlsx")
df

   Unnamed: 0    eps     pe  price tickers
0           0  27.82  30.37    845   GOOGL
1           1   4.61  14.26     65     WMT
2           2   2.12  30.97     64    MSFT

In [19]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return 50
    return cell
    
df = pd.read_excel("stocks_weather.xlsx", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell
    })
df
'''
df = pd.read_excel("stock_data.xlsx","Sheet1", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell
    })
'''

   Unnamed: 0    eps     pe  price tickers
0           0  27.82  30.37    845   GOOGL
1           1   4.61  14.26     65     WMT
2           2   2.12  30.97     64    MSFT

In [20]:
df.to_excel("new.xlsx", sheet_name="stocks", index=False, startrow=2, startcol=1) #postion in excel sheet

Write two dataframes to two separate sheets in excel

In [21]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [22]:
#write sexcel with two sheats 
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")